app/controllers/xmls_controller.rb

SELECT "xmls".* FROM "xmls"
---
  def index
    @xmls = Xml.all

SELECT  "xmls".* FROM "xmls" WHERE "xmls"."key_access" = ? LIMIT 1  [["key_access", "VQLVNB51WHCI47BF46NWRTYHQFM8465ANI61D55"]]
---
  def show2
    @xml = Xml.find_by(key_access: params[:key_access])

INSERT INTO "xmls" ("key_access", "xml_text", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @xml = Xml.new(xml_params)
    respond_to do |format|
      if @xml.save

DELETE FROM "xmls" WHERE "xmls"."id" = ?  [["id", 2]]
---
  def destroy
    @xml.destroy

SELECT  "xmls".* FROM "xmls" WHERE "xmls"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_xml
      #@xml = Xml.find_by(key_access: params[:key_access])
      @xml = Xml.find(params[:id])